In [3]:
import pandas as pd

In [ ]:
gdp = pd.read_csv('../data/read_gdp_sector_categories.csv')
gdp.head()

In [ ]:
gdp_melt = pd.melt(gdp, id_vars = 'Category', var_name = 'Year-Qtr', value_name = 'GDP')
gdp_melt.head()

In [ ]:
gdp_melt['Year'] = gdp_melt['Year-Qtr'].str.split('-', expand=True)[0]
gdp_melt['Qtr'] = gdp_melt['Year-Qtr'].str.split('-', expand=True)[1]
#gdp_melt[['Year', 'Qtr']] = gdp_melt['Year-Qtr'].str.split('-', expand=True)

In [ ]:
gdp_melt = gdp_melt.drop(columns = 'Year-Qtr')
gdp_melt.head()

In [ ]:
#gdp_melt.to_csv('read_gdp_sector_clean.csv')

In [5]:
nonfarm_jobs = pd.read_csv('../data/read_nonfarm_created.csv')
nonfarm_jobs.head()

   Year  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  2014  184  159  277  311  202  333  243  181  307  240  284  278
1  2015  196  269   94  277  337  156  294  141  135  319  226  273
2  2016  113  215  255  190   45  251  363  149  297  108  119  222
3  2017  226  212  128  197  216  199  184  135   92  147  229  146
4  2018  146  387  226  146  329  213   55  251   87  164   97  182

In [13]:
nonfarm_jobs_l = pd.melt(nonfarm_jobs, id_vars = 'Year', var_name = 'Month', value_name = 'New_Jobs')
nonfarm_jobs_l.head()

   Year Month  New_Jobs
0  2014   Jan       184
1  2015   Jan       196
2  2016   Jan       113
3  2017   Jan       226
4  2018   Jan       146

In [19]:
nonfarm_jobs_l['Year-Month'] = nonfarm_jobs_l['Year'].astype(str) + '-' + nonfarm_jobs_l['Month']

In [21]:
nonfarm_jobs_l.head()

   Year Month  New_Jobs Year-Month
0  2014   Jan       184   2014-Jan
1  2015   Jan       196   2015-Jan
2  2016   Jan       113   2016-Jan
3  2017   Jan       226   2017-Jan
4  2018   Jan       146   2018-Jan

In [23]:
nonfarm_jobs_l.to_csv('read_nonfarm_jobs_clean.csv')

In [ ]:
nonfarm_jobs['Year'] = nonfarm_jobs['Date'].str.split(' ', expand=True)[0]
nonfarm_jobs['Month'] = nonfarm_jobs['Date'].str.split(' ', expand=True)[1]

In [ ]:
nonfarm_jobs['Month'] = nonfarm_jobs['Month'].str.replace('(', '', regex=False).str.replace(')', '', regex=False)
nonfarm_jobs = nonfarm_jobs.drop(columns = 'Date')
nonfarm_jobs.head()

In [ ]:
cd ns

In [3]:
jet_fuel = pd.read_csv('../data/read_jet_fuel_rd.csv')
jet_fuel.head()

,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,1990,NaN,NaN,NaN,0.540,0.515,0.494,0.535,0.791,1.012,1.196,0.971,0.803
1,1991,0.741,0.637,0.558,0.552,0.569,0.547,0.586,0.623,0.635,0.671,0.645,0.522
2,1992,0.509,0.543,0.514,0.543,0.579,0.615,0.611,0.590,0.623,0.621,0.561,0.544
3,1993,0.534,0.553,0.558,0.551,0.553,0.526,0.494,0.501,0.535,0.568,0.533,0.446
4,1994,0.528,0.501,0.451,0.469,0.472,0.493,0.509,0.498,0.490,0.509,0.513,0.487

In [13]:
jet_fuel_melt = pd.melt(jet_fuel, id_vars = 'Year', var_name = 'Month', value_name = 'Price/Gallon')
jet_fuel_melt['Year'] = jet_fuel_melt['Year'].str.strip()
jet_fuel_melt['Month'] = jet_fuel_melt['Month'].str.strip()

In [7]:
jet_fuel_melt.tail()

       Year Month  Price/Gallon
415    2020   Dec         1.324
416    2021   Dec         2.095
417    2022   Dec         2.897
418    2023   Dec         2.387
419    2024   Dec         2.097

In [15]:
year_list = ['2021', '2022', '2023', '2024']
jet_fuel_melt = jet_fuel_melt[jet_fuel_melt['Year'].isin(year_list)]
jet_fuel_melt.head()

    Year Month  Price/Gallon
31  2021   Jan         1.420
32  2022   Jan         2.446
33  2023   Jan         3.542
34  2024   Jan         2.585
66  2021   Feb         1.601

In [17]:
jet_fuel_melt.to_csv('read_jet_fuel_clean.csv')

In [9]:
df.head()

   Year  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  2014  184  159  277  311  202  333  243  181  307  240  284  278
1  2015  196  269   94  277  337  156  294  141  135  319  226  273
2  2016  113  215  255  190   45  251  363  149  297  108  119  222
3  2017  226  212  128  197  216  199  184  135   92  147  229  146
4  2018  146  387  226  146  329  213   55  251   87  164   97  182

In [11]:
month_columns

Index(['Apr', 'Aug', 'Dec', 'Feb', 'Jan', 'Jul', 'Jun', 'Mar', 'May', 'Nov',
       'Oct', 'Sep'],
      dtype='object')